{"name":"Tails","identifier":"fi.safo.TailsSource","sourceURL":"https:\/\/tails.safo.fi\/source.json","apps":[{"name":"Tails","bundleIdentifier":"fi.safo.Tails","localizedDescription":"Tails is an e621.net\/e926.net browser app designed to improve the viewing experience over a web browser on iPhones and iPads:\n– Infinite Scrolling\n– Hi-Res Images\n– Local Tag Subscriptions\n– WebM Player\n\nTails also includes support for browsing pools, favoriting and voting on posts, autocompleting search and image downloading to your device.\n\nMore information at https:\/\/tails.safo.fi!\n\nContact:\nEmail: tails@safo.fi\nTelegram: t.me\/SafoSnep\nApp updates: t.me\/TailsApp (channel) and t.me\/TailsChat (chat group)","developerName":"Safo","version":"2.2.1","versionDate":"2022-06-12T19:45:01+00:00","versionDescription":"- Fixed a visual glitch where the pincode screen would show a pixel’s width of previous content\n\nNew features and changes in version 2.2:\n- Four new quirky themes (two light and two dark)\n\t- Also a pretty large overhaul to the theming system making it easier to create new themes in the future - suggestions\/inspiration welcome!\n- Multiple new icons, including a couple of \u0026quot;incognito\u0026quot; icons to blend in with your regular apps\n\t- Icon ideas, concepts and suggestions are also much appreciated, and they’ll always be credited to you in the app’s settings.\n- Image scaling modes in Behavior settings:\n\t- Always fill screen horizontally (current default option),\n\t- Scale to fit in landscape mode (possibly a future default option),\n\t- Always scale image to fit screen\n- A slideshow option for images (available from the long press menu when viewing them in the horizontal detail view)\n- Added a search for pools\n- Redesigned pool list and pool indicator in the posts’ detail view\n- Post relationships: parent\/child posts are listed below the post’s tags like the pools that the post belongs to\n- Post filters in the sorting menu: hide still images, hide animations, or hide child posts\n- Date range shortcuts in the sorting menu: quick filters for searching posts within the last day, month, week, year or decade\n\nBug fixes:\n- Fixes a crash when updating favorited\/subscribed tags\n- Fixed an issue where a manually searched tag, that was also favorited, would change its color to gray\n- Fixes high CPU usage after scrolling quickly through a long list of posts\n- A post’s detail view will no longer flicker visually when scrolling when the view was scrolled all the way to the top or bottom","downloadURL":"http:\/\/10.0.0.3\/downloads\/Tails-2.2.1-69f3900ec63a6bb49a90ba634dea20d6231ff0654a09b2269244b247b336e6a2.ipa","iconURL":"https:\/\/tails.safo.fi\/img\/appIcon.png","tintColor":"ed7b1f","size":3453348,"screenshotURLs":["https:\/\/tails.safo.fi\/img\/altstore2.png","https:\/\/tails.safo.fi\/img\/altstore1.png","https:\/\/tails.safo.fi\/img\/altstore3.png"]}],"news":[{"title":"Major Tails update brings new features and themes","identifier":"tails-2point2","caption":"Tails version 2.2 brings useful new features such as image scaling, searching for pools, and new themes and icons, as well as some performance improvements.","tintColor":"ed7b1f","date":"2022-06-08","notify":false},{"title":"Tails gains iOS 15 compatibility","identifier":"tails-2point1","caption":"With version 2.1 Tails becomes compatible with iOS 15, and contains other useful bug fixes too!","tintColor":"ed7b1f","date":"2021-09-20","notify":false},{"title":"A Big Tails Update","identifier":"tails-2point0","caption":"After a long time in the making, a new version of Tails is now available. Check out the app page for release notes! As always, any feedback is very welcome. @SafoSnep","tintColor":"ed7b1f","date":"2021-02-27","notify":false},{"title":"A Message from Safo","identifier":"tails-hello","caption":"You\u0027ve installed Tails\u0027 AltStore source! 🎉 If you have any questions, I can be reached by tails@safo.fi and in Telegram at t.me\/SafoSnep.","tintColor":"758bea","date":"2020-05-19","notify":false}]}